docs/Sample.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:rem="http://remittance.webservice.carnelian.ccti.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <rem:createTransaction>
         <!--Optional:-->
          <arg0>
 		<password></password>
 		<username></username>
 	  </arg0>
 	  <arg1>
 		<accountName></accountName>
 		<accountNumber></accountNumber>
 		<accountType></accountType>
 		<altBeneName></altBeneName>
 		<altBeneRelToBene></altBeneRelToBene>
 		<altRecRelToBene></altRecRelToBene>
 		<applicationNumber></applicationNumber>
 		<bankCode></bankCode>
 		<bankName></bankName>
 		<beneAddr1></beneAddr1>
 		<beneAddr2></beneAddr2>
 		<beneAddr3></beneAddr3>
 		<beneAmtConv></beneAmtConv>
 		<beneBdate></beneBdate>
 		<beneCcyCd></beneCcyCd>
 		<beneCivilStatus></beneCivilStatus>
 		<beneCountry></beneCountry>
 		<beneCustType></beneCustType>
 		<beneEmail></beneEmail>
 		<beneGender></beneGender>
 		<beneId></beneId>
 		<beneLandmark></beneLandmark>
 		<beneLastName></beneLastName>
 		<beneMiddleName></beneMiddleName>
 		<beneMobileNo></beneMobileNo>
 		<beneNationality></beneNationality>
 		<beneNotificationType></beneNotificationType>
		<beneOfficePhoneNumber></beneOfficePhoneNumber>
 		<benePoBox></benePoBox>
 		<beneProfession></beneProfession>
 		<beneRelationToRemitter></beneRelationToRemitter>
 		<beneTin></beneTin>
 		<beneZipCode></beneZipCode>
 		<benefirstName></benefirstName>
 		<branchCode></branchCode>
 		<branchName></branchName>
 		<cardNo></cardNo>
 		<counterCharge></counterCharge>
 		<dtRemittance></dtRemittance>
 		<individualCode></individualCode>
 		<isWaived></isWaived>
 		<messageToBene></messageToBene>
 		<modeOfCharge></modeOfCharge>
 		<otherCharges></otherCharges>
 		<outletBranchCd></outletBranchCd>
 		<outletCd></outletCd>
 		<paymentField1></paymentField1>
 		<paymentField2></paymentField2>
 		<paymentField3></paymentField3>
 		<paymentField4></paymentField4>
 		<paymentField5></paymentField5>
 		<purposeCode></purposeCode>
 		<receiverCorrBank></receiverCorrBank>
 		<receivingBank></receivingBank>
 		<remitterAddr1></remitterAddr1>
 		<remitterAddr2></remitterAddr2>
 		<remitterAddr3></remitterAddr3>
 		<remitterBdate></remitterBdate>
 		<remitterCivilStatus></remitterCivilStatus>
 		<remitterContinent></remitterContinent>
 		<remitterCountry></remitterCountry>
 		<remitterCustType></remitterCustType>
 		<remitterEmailAddr></remitterEmailAddr>
 		<remitterExpiryDate1></remitterExpiryDate1>
 		<remitterExpiryDate2></remitterExpiryDate2>
 		<remitterFirstName></remitterFirstName>
 		<remitterGender></remitterGender>
 		<remitterId></remitterId>
 		<remitterIdIssueAt1></remitterIdIssueAt1>
 		<remitterIdIssueAt2></remitterIdIssueAt2>
 		<remitterIdNumber1></remitterIdNumber1>
		<remitterIdNumber2></remitterIdNumber2>
 		<remitterIdType1></remitterIdType1>
		<remitterIdType2></remitterIdType2>
		<remitterLastName></remitterLastName>
		<remitterMiddleName></remitterMiddleName>
 		<remitterMobileNumber></remitterMobileNumber>
 		<remitterNationality></remitterNationality>
 		<remitterNotificationType></remitterNotificationType>
 		<remitterOfficePhoneNumber></remitterOfficePhoneNumber>
 		<remitterPoBox></remitterPoBox>
 		<remitterTin></remitterTin>
 		<remitterZipCode></remitterZipCode>
 		<rtBuyingApplied></rtBuyingApplied>
 		<senderCorrBank></senderCorrBank>
 		<sendingBank></sendingBank>
 		<serviceCode></serviceCode>
 		<xmitAmount></xmitAmount>
 		<xmitCcyCd></xmitCcyCd>
 	</arg1>
      </rem:createTransaction>
   </soapenv:Body>
</soapenv:Envelope>
